In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("/home/gaurav/Documents/TitanicPred/data/raw/output.csv")

In [23]:
df.drop(columns=["Unnamed: 0", "Name"], axis=1).head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [14]:
# df["Cabin"].str.extract(r"([a-zA-Z]+)")
df["Cabin"].str.extract(r"([0-9]+)")

       0
0    NaN
1     85
2    NaN
3    123
4    NaN
..   ...
886  NaN
887   42
888  NaN
889  148
890  NaN

[891 rows x 1 columns]